## Setup

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns

In [4]:
#load data
customers = pd.read_csv('data_imgs/twm_customer.csv', sep=";")
customers.head()

,cust_id,income,age,years_with_bank,nbr_children,gender,marital_status,name_prefix,first_name,last_name,street_nbr,street_name,postal_code,city_name,state_code
0,1362691,26150,46,5,1,M,2,,Donald ...,Marek ...,8298,Second ...,89194,Las Vegas,NV
1,1362487,6605,71,1,0,M,2,,ChingDyi ...,Moussavi ...,10603,Daffodil ...,90159,Los Angeles,CA
2,1363160,18548,38,8,0,F,1,,Rosa ...,Johnston ...,8817,Figueroa ...,90024,Los Angeles,CA
3,1362752,47668,54,3,0,F,1,,Lisa ...,Martin ...,676,Humble ...,90172,Los Angeles,CA
4,1362548,44554,59,9,2,F,4,,Barbara ...,O'Malley ...,6578,C ...,10138,New York City,NY

In [59]:
#don't want noise: first or last name, street number, or postal code
customers_df = customers.drop(['cust_id', 'first_name','last_name', 'street_nbr', 'postal_code'], axis=1)

#Let's check for missing data in percentage
missing_data = pd.DataFrame(customers_df.isnull().sum() / len(customers_df), 
             columns=['percent_null']).sort_values('percent_null',ascending=False)
missing_data

                 percent_null
income                    0.0
age                       0.0
years_with_bank           0.0
nbr_children              0.0
gender                    0.0
marital_status            0.0
name_prefix               0.0
street_name               0.0
city_name                 0.0
state_code                0.0

## Categorical features

In [60]:
#each feature's datatypes
customers_df.dtypes

income              int64
age                 int64
years_with_bank     int64
nbr_children        int64
gender             object
marital_status      int64
name_prefix        object
street_name        object
city_name          object
state_code         object
dtype: object

In [55]:
#gender can become T/F binary
#check unique
customers_df.gender.unique()

array(['M ', 'F '], dtype=object)